10/data/attachments/d4f7ac50d70dec66.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Brian_Mrs_Friend_93583_7</nif:username>
            <nif:friendToBeRequested>soap_friends_f88cbd7e-7760-4471-ab6e-83dbb5fb2da5</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>